ataradov/mcu-starter-projects/samg53/include/component/pio.h
#define PIO_IFER_P_Pos                      0                                              /**< (PIO_IFER Position) Input Filter Enable */
#define PIO_IFER_P_Msk                      (_U_(0xFFFFFFFF) << PIO_IFER_P_Pos)            /**< (PIO_IFER Mask) P */
#define PIO_IFER_P(value)                   (PIO_IFER_P_Msk & ((value) << PIO_IFER_P_Pos))  

/* -------- PIO_IFDR : (PIO Offset: 0x24) (/W 32) Glitch Input Filter Disable Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t P0:1;                      /**< bit:      0  Input Filter Disable                     */
    uint32_t P1:1;                      /**< bit:      1  Input Filter Disable                     */
    uint32_t P2:1;                      /**< bit:      2  Input Filter Disable                     */
    uint32_t P3:1;                      /**< bit:      3  Input Filter Disable                     */
    uint32_t P4:1;                      /**< bit:      4  Input Filter Disable                     */
    uint32_t P5:1;                      /**< bit:      5  Input Filter Disable                     */
    uint32_t P6:1;                      /**< bit:      6  Input Filter Disable                     */
    uint32_t P7:1;                      /**< bit:      7  Input Filter Disable                     */
    uint32_t P8:1;                      /**< bit:      8  Input Filter Disable                     */
    uint32_t P9:1;                      /**< bit:      9  Input Filter Disable                     */
    uint32_t P10:1;                     /**< bit:     10  Input Filter Disable                     */
    uint32_t P11:1;                     /**< bit:     11  Input Filter Disable                     */
    uint32_t P12:1;                     /**< bit:     12  Input Filter Disable                     */
    uint32_t P13:1;                     /**< bit:     13  Input Filter Disable                     */
    uint32_t P14:1;                     /**< bit:     14  Input Filter Disable                     */
    uint32_t P15:1;                     /**< bit:     15  Input Filter Disable                     */
    uint32_t P16:1;                     /**< bit:     16  Input Filter Disable                     */
    uint32_t P17:1;                     /**< bit:     17  Input Filter Disable                     */
    uint32_t P18:1;                     /**< bit:     18  Input Filter Disable                     */
    uint32_t P19:1;                     /**< bit:     19  Input Filter Disable                     */
    uint32_t P20:1;                     /**< bit:     20  Input Filter Disable                     */
    uint32_t P21:1;                     /**< bit:     21  Input Filter Disable                     */
    uint32_t P22:1;                     /**< bit:     22  Input Filter Disable                     */
    uint32_t P23:1;                     /**< bit:     23  Input Filter Disable                     */
    uint32_t P24:1;                     /**< bit:     24  Input Filter Disable                     */
    uint32_t P25:1;                     /**< bit:     25  Input Filter Disable                     */
    uint32_t P26:1;                     /**< bit:     26  Input Filter Disable                     */
    uint32_t P27:1;                     /**< bit:     27  Input Filter Disable                     */
    uint32_t P28:1;                     /**< bit:     28  Input Filter Disable                     */
    uint32_t P29:1;                     /**< bit:     29  Input Filter Disable                     */
    uint32_t P30:1;                     /**< bit:     30  Input Filter Disable                     */
    uint32_t P31:1;                     /**< bit:     31  Input Filter Disable                     */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t P:32;                      /**< bit:  0..31  Input Filter Disable                     */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} PIO_IFDR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PIO_IFDR_OFFSET                     (0x24)                                        /**<  (PIO_IFDR) Glitch Input Filter Disable Register  Offset */

#define PIO_IFDR_P0_Pos                     0                                              /**< (PIO_IFDR) Input Filter Disable Position */
#define PIO_IFDR_P0_Msk                     (_U_(0x1) << PIO_IFDR_P0_Pos)                  /**< (PIO_IFDR) Input Filter Disable Mask */
#define PIO_IFDR_P0                         PIO_IFDR_P0_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFDR_P0_Msk instead */
#define PIO_IFDR_P1_Pos                     1                                              /**< (PIO_IFDR) Input Filter Disable Position */
#define PIO_IFDR_P1_Msk                     (_U_(0x1) << PIO_IFDR_P1_Pos)                  /**< (PIO_IFDR) Input Filter Disable Mask */
#define PIO_IFDR_P1                         PIO_IFDR_P1_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFDR_P1_Msk instead */
#define PIO_IFDR_P2_Pos                     2                                              /**< (PIO_IFDR) Input Filter Disable Position */
#define PIO_IFDR_P2_Msk                     (_U_(0x1) << PIO_IFDR_P2_Pos)                  /**< (PIO_IFDR) Input Filter Disable Mask */
#define PIO_IFDR_P2                         PIO_IFDR_P2_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFDR_P2_Msk instead */
#define PIO_IFDR_P3_Pos                     3                                              /**< (PIO_IFDR) Input Filter Disable Position */
#define PIO_IFDR_P3_Msk                     (_U_(0x1) << PIO_IFDR_P3_Pos)                  /**< (PIO_IFDR) Input Filter Disable Mask */
#define PIO_IFDR_P3                         PIO_IFDR_P3_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFDR_P3_Msk instead */
#define PIO_IFDR_P4_Pos                     4                                              /**< (PIO_IFDR) Input Filter Disable Position */
#define PIO_IFDR_P4_Msk                     (_U_(0x1) << PIO_IFDR_P4_Pos)                  /**< (PIO_IFDR) Input Filter Disable Mask */
#define PIO_IFDR_P4                         PIO_IFDR_P4_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFDR_P4_Msk instead */
#define PIO_IFDR_P5_Pos                     5                                              /**< (PIO_IFDR) Input Filter Disable Position */
#define PIO_IFDR_P5_Msk                     (_U_(0x1) << PIO_IFDR_P5_Pos)                  /**< (PIO_IFDR) Input Filter Disable Mask */
#define PIO_IFDR_P5                         PIO_IFDR_P5_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFDR_P5_Msk instead */
#define PIO_IFDR_P6_Pos                     6                                              /**< (PIO_IFDR) Input Filter Disable Position */
#define PIO_IFDR_P6_Msk                     (_U_(0x1) << PIO_IFDR_P6_Pos)                  /**< (PIO_IFDR) Input Filter Disable Mask */
#define PIO_IFDR_P6                         PIO_IFDR_P6_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFDR_P6_Msk instead */
#define PIO_IFDR_P7_Pos                     7                                              /**< (PIO_IFDR) Input Filter Disable Position */
#define PIO_IFDR_P7_Msk                     (_U_(0x1) << PIO_IFDR_P7_Pos)                  /**< (PIO_IFDR) Input Filter Disable Mask */
#define PIO_IFDR_P7                         PIO_IFDR_P7_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFDR_P7_Msk instead */
#define PIO_IFDR_P8_Pos                     8                                              /**< (PIO_IFDR) Input Filter Disable Position */
#define PIO_IFDR_P8_Msk                     (_U_(0x1) << PIO_IFDR_P8_Pos)                  /**< (PIO_IFDR) Input Filter Disable Mask */
#define PIO_IFDR_P8                         PIO_IFDR_P8_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFDR_P8_Msk instead */
#define PIO_IFDR_P9_Pos                     9                                              /**< (PIO_IFDR) Input Filter Disable Position */
#define PIO_IFDR_P9_Msk                     (_U_(0x1) << PIO_IFDR_P9_Pos)                  /**< (PIO_IFDR) Input Filter Disable Mask */
#define PIO_IFDR_P9                         PIO_IFDR_P9_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFDR_P9_Msk instead */
#define PIO_IFDR_P10_Pos                    10                                             /**< (PIO_IFDR) Input Filter Disable Position */
#define PIO_IFDR_P10_Msk                    (_U_(0x1) << PIO_IFDR_P10_Pos)                 /**< (PIO_IFDR) Input Filter Disable Mask */
#define PIO_IFDR_P10                        PIO_IFDR_P10_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFDR_P10_Msk instead */
#define PIO_IFDR_P11_Pos                    11                                             /**< (PIO_IFDR) Input Filter Disable Position */
#define PIO_IFDR_P11_Msk                    (_U_(0x1) << PIO_IFDR_P11_Pos)                 /**< (PIO_IFDR) Input Filter Disable Mask */
#define PIO_IFDR_P11                        PIO_IFDR_P11_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFDR_P11_Msk instead */
#define PIO_IFDR_P12_Pos                    12                                             /**< (PIO_IFDR) Input Filter Disable Position */
#define PIO_IFDR_P12_Msk                    (_U_(0x1) << PIO_IFDR_P12_Pos)                 /**< (PIO_IFDR) Input Filter Disable Mask */
#define PIO_IFDR_P12                        PIO_IFDR_P12_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFDR_P12_Msk instead */
#define PIO_IFDR_P13_Pos                    13                                             /**< (PIO_IFDR) Input Filter Disable Position */
#define PIO_IFDR_P13_Msk                    (_U_(0x1) << PIO_IFDR_P13_Pos)                 /**< (PIO_IFDR) Input Filter Disable Mask */
#define PIO_IFDR_P13                        PIO_IFDR_P13_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFDR_P13_Msk instead */
#define PIO_IFDR_P14_Pos                    14                                             /**< (PIO_IFDR) Input Filter Disable Position */
#define PIO_IFDR_P14_Msk                    (_U_(0x1) << PIO_IFDR_P14_Pos)                 /**< (PIO_IFDR) Input Filter Disable Mask */
#define PIO_IFDR_P14                        PIO_IFDR_P14_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFDR_P14_Msk instead */
#define PIO_IFDR_P15_Pos                    15                                             /**< (PIO_IFDR) Input Filter Disable Position */
#define PIO_IFDR_P15_Msk                    (_U_(0x1) << PIO_IFDR_P15_Pos)                 /**< (PIO_IFDR) Input Filter Disable Mask */
#define PIO_IFDR_P15                        PIO_IFDR_P15_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFDR_P15_Msk instead */
#define PIO_IFDR_P16_Pos                    16                                             /**< (PIO_IFDR) Input Filter Disable Position */
#define PIO_IFDR_P16_Msk                    (_U_(0x1) << PIO_IFDR_P16_Pos)                 /**< (PIO_IFDR) Input Filter Disable Mask */
#define PIO_IFDR_P16                        PIO_IFDR_P16_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFDR_P16_Msk instead */
#define PIO_IFDR_P17_Pos                    17                                             /**< (PIO_IFDR) Input Filter Disable Position */
#define PIO_IFDR_P17_Msk                    (_U_(0x1) << PIO_IFDR_P17_Pos)                 /**< (PIO_IFDR) Input Filter Disable Mask */
#define PIO_IFDR_P17                        PIO_IFDR_P17_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFDR_P17_Msk instead */
#define PIO_IFDR_P18_Pos                    18                                             /**< (PIO_IFDR) Input Filter Disable Position */
#define PIO_IFDR_P18_Msk                    (_U_(0x1) << PIO_IFDR_P18_Pos)                 /**< (PIO_IFDR) Input Filter Disable Mask */
#define PIO_IFDR_P18                        PIO_IFDR_P18_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFDR_P18_Msk instead */
#define PIO_IFDR_P19_Pos                    19                                             /**< (PIO_IFDR) Input Filter Disable Position */
#define PIO_IFDR_P19_Msk                    (_U_(0x1) << PIO_IFDR_P19_Pos)                 /**< (PIO_IFDR) Input Filter Disable Mask */
#define PIO_IFDR_P19                        PIO_IFDR_P19_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFDR_P19_Msk instead */
#define PIO_IFDR_P20_Pos                    20                                             /**< (PIO_IFDR) Input Filter Disable Position */
#define PIO_IFDR_P20_Msk                    (_U_(0x1) << PIO_IFDR_P20_Pos)                 /**< (PIO_IFDR) Input Filter Disable Mask */
#define PIO_IFDR_P20                        PIO_IFDR_P20_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFDR_P20_Msk instead */
#define PIO_IFDR_P21_Pos                    21                                             /**< (PIO_IFDR) Input Filter Disable Position */
#define PIO_IFDR_P21_Msk                    (_U_(0x1) << PIO_IFDR_P21_Pos)                 /**< (PIO_IFDR) Input Filter Disable Mask */
#define PIO_IFDR_P21                        PIO_IFDR_P21_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFDR_P21_Msk instead */
#define PIO_IFDR_P22_Pos                    22                                             /**< (PIO_IFDR) Input Filter Disable Position */
#define PIO_IFDR_P22_Msk                    (_U_(0x1) << PIO_IFDR_P22_Pos)                 /**< (PIO_IFDR) Input Filter Disable Mask */
#define PIO_IFDR_P22                        PIO_IFDR_P22_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFDR_P22_Msk instead */
#define PIO_IFDR_P23_Pos                    23                                             /**< (PIO_IFDR) Input Filter Disable Position */
#define PIO_IFDR_P23_Msk                    (_U_(0x1) << PIO_IFDR_P23_Pos)                 /**< (PIO_IFDR) Input Filter Disable Mask */
#define PIO_IFDR_P23                        PIO_IFDR_P23_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFDR_P23_Msk instead */
#define PIO_IFDR_P24_Pos                    24                                             /**< (PIO_IFDR) Input Filter Disable Position */
#define PIO_IFDR_P24_Msk                    (_U_(0x1) << PIO_IFDR_P24_Pos)                 /**< (PIO_IFDR) Input Filter Disable Mask */
#define PIO_IFDR_P24                        PIO_IFDR_P24_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFDR_P24_Msk instead */
#define PIO_IFDR_P25_Pos                    25                                             /**< (PIO_IFDR) Input Filter Disable Position */
#define PIO_IFDR_P25_Msk                    (_U_(0x1) << PIO_IFDR_P25_Pos)                 /**< (PIO_IFDR) Input Filter Disable Mask */
#define PIO_IFDR_P25                        PIO_IFDR_P25_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFDR_P25_Msk instead */
#define PIO_IFDR_P26_Pos                    26                                             /**< (PIO_IFDR) Input Filter Disable Position */
#define PIO_IFDR_P26_Msk                    (_U_(0x1) << PIO_IFDR_P26_Pos)                 /**< (PIO_IFDR) Input Filter Disable Mask */
#define PIO_IFDR_P26                        PIO_IFDR_P26_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFDR_P26_Msk instead */
#define PIO_IFDR_P27_Pos                    27                                             /**< (PIO_IFDR) Input Filter Disable Position */
#define PIO_IFDR_P27_Msk                    (_U_(0x1) << PIO_IFDR_P27_Pos)                 /**< (PIO_IFDR) Input Filter Disable Mask */
#define PIO_IFDR_P27                        PIO_IFDR_P27_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFDR_P27_Msk instead */
#define PIO_IFDR_P28_Pos                    28                                             /**< (PIO_IFDR) Input Filter Disable Position */
#define PIO_IFDR_P28_Msk                    (_U_(0x1) << PIO_IFDR_P28_Pos)                 /**< (PIO_IFDR) Input Filter Disable Mask */
#define PIO_IFDR_P28                        PIO_IFDR_P28_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFDR_P28_Msk instead */
#define PIO_IFDR_P29_Pos                    29                                             /**< (PIO_IFDR) Input Filter Disable Position */
#define PIO_IFDR_P29_Msk                    (_U_(0x1) << PIO_IFDR_P29_Pos)                 /**< (PIO_IFDR) Input Filter Disable Mask */
#define PIO_IFDR_P29                        PIO_IFDR_P29_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFDR_P29_Msk instead */
#define PIO_IFDR_P30_Pos                    30                                             /**< (PIO_IFDR) Input Filter Disable Position */
#define PIO_IFDR_P30_Msk                    (_U_(0x1) << PIO_IFDR_P30_Pos)                 /**< (PIO_IFDR) Input Filter Disable Mask */
#define PIO_IFDR_P30                        PIO_IFDR_P30_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFDR_P30_Msk instead */
#define PIO_IFDR_P31_Pos                    31                                             /**< (PIO_IFDR) Input Filter Disable Position */
#define PIO_IFDR_P31_Msk                    (_U_(0x1) << PIO_IFDR_P31_Pos)                 /**< (PIO_IFDR) Input Filter Disable Mask */
#define PIO_IFDR_P31                        PIO_IFDR_P31_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PIO_IFDR_P31_Msk instead */
#define PIO_IFDR_MASK                       _U_(0xFFFFFFFF)                                /**< \deprecated (PIO_IFDR) Register MASK  (Use PIO_IFDR_Msk instead)  */
#define PIO_IFDR_Msk                        _U_(0xFFFFFFFF)                                /**< (PIO_IFDR) Register Mask  */

#define PIO_IFDR_P_Pos                      0                                              /**< (PIO_IFDR Position) Input Filter Disable */
#define PIO_IFDR_P_Msk                      (_U_(0xFFFFFFFF) << PIO_IFDR_P_Pos)            /**< (PIO_IFDR Mask) P */
#define PIO_IFDR_P(value)                   (PIO_IFDR_P_Msk & ((value) << PIO_IFDR_P_Pos))  

/* -------- PIO_IFSR : (PIO Offset: 0x28) (R/ 32) Glitch Input Filter Status Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t P0:1;                      /**< bit:      0  Input Filter Status                      */
    uint32_t P1:1;                      /**< bit:      1  Input Filter Status                      */
    uint32_t P2:1;                      /**< bit:      2  Input Filter Status                      */
    uint32_t P3:1;                      /**< bit:      3  Input Filter Status                      */
    uint32_t P4:1;                      /**< bit:      4  Input Filter Status                      */
    uint32_t P5:1;                      /**< bit:      5  Input Filter Status                      */
    uint32_t P6:1;                      /**< bit:      6  Input Filter Status                      */
    uint32_t P7:1;                      /**< bit:      7  Input Filter Status                      */
    uint32_t P8:1;                      /**< bit:      8  Input Filter Status                      */
    uint32_t P9:1;                      /**< bit:      9  Input Filter Status                      */
    uint32_t P10:1;                     /**< bit:     10  Input Filter Status                      */
    uint32_t P11:1;                     /**< bit:     11  Input Filter Status                      */
    uint32_t P12:1;                     /**< bit:     12  Input Filter Status                      */
    uint32_t P13:1;                     /**< bit:     13  Input Filter Status                      */
    uint32_t P14:1;                     /**< bit:     14  Input Filter Status                      */
    uint32_t P15:1;                     /**< bit:     15  Input Filter Status                      */
    uint32_t P16:1;                     /**< bit:     16  Input Filter Status                      */
    uint32_t P17:1;                     /**< bit:     17  Input Filter Status                      */
    uint32_t P18:1;                     /**< bit:     18  Input Filter Status                      */
    uint32_t P19:1;                     /**< bit:     19  Input Filter Status                      */
    uint32_t P20:1;                     /**< bit:     20  Input Filter Status                      */
    uint32_t P21:1;                     /**< bit:     21  Input Filter Status                      */
    uint32_t P22:1;                     /**< bit:     22  Input Filter Status                      */
    uint32_t P23:1;                     /**< bit:     23  Input Filter Status                      */
    uint32_t P24:1;                     /**< bit:     24  Input Filter Status                      */
    uint32_t P25:1;                     /**< bit:     25  Input Filter Status                      */
    uint32_t P26:1;                     /**< bit:     26  Input Filter Status                      */
    uint32_t P27:1;                     /**< bit:     27  Input Filter Status                      */
    uint32_t P28:1;                     /**< bit:     28  Input Filter Status                      */
    uint32_t P29:1;                     /**< bit:     29  Input Filter Status                      */
    uint32_t P30:1;                     /**< bit:     30  Input Filter Status                      */
    uint32_t P31:1;                     /**< bit:     31  Input Filter Status                      */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t P:32;                      /**< bit:  0..31  Input Filter Status                      */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} PIO_IFSR_Type;
